var skillsdata;


var initSkillsdata = function () {
    skillsdata = {
        staData: {
            "{\"name\":\"6-普通信息\",\"id\":\"6\",\"parameter\":\"rank\"}": {
                "{\"name\":\"性能管理\",\"id\":\"性能管理\",\"parameter\":\"source\"}": {
                    "{\"name\":\"性能门限任务管理\",\"id\":\"性能门限任务管理\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 179],
                    "{\"name\":\"性能测量任务管理\",\"id\":\"性能测量任务管理\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 179]
                },
                "{\"name\":\"控制台\",\"id\":\"控制台\",\"parameter\":\"source\"}": {
                    "{\"name\":\"启动 WEB应用进程1\",\"id\":\"启动 WEB应用进程1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
                    "{\"name\":\"停止 Nginx服务器1\",\"id\":\"停止 Nginx服务器1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2],
                    "{\"name\":\"启动 ngict1\",\"id\":\"启动 ngict1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
                    "{\"name\":\"启动 Nginx服务器1\",\"id\":\"启动 Nginx服务器1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3],
                    "{\"name\":\"启动 ITM进程1\",\"id\":\"启动 ITM进程1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
                },
                "{\"name\":\"告警管理\",\"id\":\"告警管理\",\"parameter\":\"source\"}": {
                    "{\"name\":\"告警定时同步\",\"id\":\"告警定时同步\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2]
                },
                "{\"name\":\"ITM进程1\",\"id\":\"ITM进程1\",\"parameter\":\"source\"}": {
                    "{\"name\":\"启动 网管平台进程1\",\"id\":\"启动 网管平台进程1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
                    "{\"name\":\"启动 ITM Proxy进程1\",\"id\":\"启动 ITM Proxy进程1\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
                },
                "{\"name\":\"日志管理\",\"id\":\"日志管理\",\"parameter\":\"source\"}": {
                    "{\"name\":\"日志临时记录入库\",\"id\":\"日志临时记录入库\",\"parameter\":\"taskname\"}": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
                }
            }
        }
    };
    var bb = {bb: 0};
    var a = {};
    a[bb] = 10213;
    //skillsdata = JSON.parse(stringData);
};
initSkillsdata();

